#include <iostream>
//----------------------------------------------------------------------------------------------------------------------
// Дано целое число num. Сложить все его цифры, пока результат не станет только одной цифрой, и вернуть его.

// Пример 1:
// Входные данные: num = 38
// Выходные данные: 2
// Пояснение: Процесс:
// 38 --> 3 + 8 --> 11
// 11 --> 1 + 1 --> 2
// Поскольку число 2 состоит только из одной цифры, верните его.

// Пример 2:
// Входные данные: num = 0
// Выходные данные: 0

// Ограничения:
// 0 <= num <= 2^31 - 1
//----------------------------------------------------------------------------------------------------------------------
int addDigits(int num)
{
  static const int base = 10;

  if (num == 0)
    return 0;

  return 1 + ((num - 1) % (base - 1));
}
//----------------------------------------------------------------------------------------------------------------------
int main()
{
  std::cout << "add digits" << std::endl;

  for (int i = 0; i < 0x100; ++i)
    std::cout << "addDigits(" << i << ") --> " << addDigits(i) << std::endl;

  return 0;
}
//----------------------------------------------------------------------------------------------------------------------
