#include "../../common/common.h"
//----------------------------------------------------------------------------------------------------------------------
// Дан массив строк words, индексация с 0 и символ x.
// Вернуть массив индексов слов, содержащие символ x.
// Возвращаемый массив может располагаться в любом порядке.

// Пример 1:
// Входные данные: words = ["leet","code"], x = "e"
// Выходные данные: [0,1]
// Пояснение: "e" встречается в обоих словах: "leet" и "code". Следовательно, вурнуть индексы 0 и 1.

// Пример 2:
// Входные данные: words = ["abc","bcd","aaaa","cbc"], x = "a"
// Выходные данные: [0,2]
// Пояснение: "a" встречается в словах "abc" и "aaaa". Следовательно, вернуть индексы 0 и 2.

// Пример 3:
// Входные данные: words = ["abc","bcd","aaaa","cbc"], x = "z"
// Выходные данные: []
// Пояснение: "z" не встречается ни в одном из слов. Следовательно, вернуть пустой массив.

// Ограничения:
// 1 <= words.length <= 50
// 1 <= words[i].length <= 50
// x — строчная английская буква.
// words[i] состоит только из строчных английских букв.
//----------------------------------------------------------------------------------------------------------------------
std::vector<int> findWordsContaining(const std::vector<std::string> & words, char x)
{
  std::vector<int> resp;

  for (int i = 0; i < words.size(); ++i)
    if (words[i].contains(x))
      resp.push_back(i);

  return resp;
}
//----------------------------------------------------------------------------------------------------------------------
int main()
{
  std::cout << "find words containing character" << std::endl;

  printContainer(findWordsContaining({"leet", "code"}, 'e')); // 0 1
  printContainer(findWordsContaining({"abc","bcd","aaaa","cbc"}, 'a')); // 0 2
  printContainer(findWordsContaining({"abc","bcd","aaaa","cbc"}, 'z'));

  return 0;
}
//----------------------------------------------------------------------------------------------------------------------
