#include <iostream>
#include <string>
#include <unordered_set>
//----------------------------------------------------------------------------------------------------------------------
// Панграмма - предложение, в котором каждая буква алфавита встречается хотя бы один раз.
// Дана строка - предложение, содержащее только строчные английские буквы.
// Вернуть true, если предложение является панграммой, и false в противном случае.

// Пример 1:
// Входные данные: предложение = "thequickbrownfoxjumpsoverthelazydog"
// Выходные данные: true
// Пояснение: предложение содержит хотя бы одну каждую букву английского алфавита.

// Пример 2:
// Входные данные: предложение = "leetcode"
// Выходные данные: false

// Ограничения:
// 1 <= sentence.length <= 1000
// Предложение состоит из строчных английских букв.
//----------------------------------------------------------------------------------------------------------------------
namespace
{
  size_t l_minLen = 'z' - 'a' + 1;
}
//----------------------------------------------------------------------------------------------------------------------
bool isPangram(const std::string & sentence)
{
  std::unordered_set<char> chars;
  for (const auto ch : sentence)
    chars.insert(ch);
  return chars.size() == l_minLen;
}
//----------------------------------------------------------------------------------------------------------------------
int main()
{
  std::cout << "check if the sentence is pangram" << std::endl;

  std::cout << std::boolalpha;
  std::cout << isPangram("thequickbrownfoxjumpsoverthelazydog") << std::endl; // true
  std::cout << isPangram("leetcode") << std::endl; // false

  return 0;
}
//----------------------------------------------------------------------------------------------------------------------
